Revit 2027 API
ReferenceArrayArray.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	ReferenceArray item,
	int index
)
Public Overridable Sub Insert (
	item As ReferenceArray,
	index As Integer
)
public:
virtual void Insert(
	ReferenceArray^ item,
	int index
)
abstract Insert :
        item : ReferenceArray *
        index : int -> unit
override Insert :
        item : ReferenceArray *
        index : int -> unit
Parameters
item ReferenceArray
index Int32
See Also
Reference
ReferenceArrayArray Class
Autodesk.Revit.DB Namespace